DataProcessors/Тест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>Тест</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Глава</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Главы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТестирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыТест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правельно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравельныйОтвет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеОтметки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/Тест/Ext/ManagerModule.bsl
Процедура Печать(ТабДокумент, Ссылка) Экспорт 
	 //Получаем макет по его названию (модуль объекта)
	 Макет = Обработки.Тест.ПолучитьМакет("МакетНеправельныеОтветы");
	 
	 
	 //Получаем доступ к разделу "Шапка"
	 Шапка = Макет.ПолучитьОбласть("Шапка");
	 //Добавляем шапку в табличный документ
	 ТабДокумент.Вывести(Шапка);
	 
	 Вопрос = Макет.ПолучитьОбласть("СтрокаВопрос|Вертикаль");
	 //Получаем доступ к разделу "Строка"
	 Строка = Макет.ПолучитьОбласть("Строка");
	 
	 Контроль = ""; 
	 Для Каждого Стр из Ссылка Цикл
	      //Заполняем строку макета данными полей справочника
		  Если Контроль = "" ИЛИ Контроль <> Стр.Вопрос Тогда
	      		Вопрос.Параметры.Вопрос = Стр.Вопрос;
				Контроль = Стр.Вопрос;
				ТабДокумент.Вывести(Вопрос);
		  КонецЕсли; 
		  Строка.Параметры.Ответ = Стр.Ответ;
		  Строка.Параметры.ПравельныйОтвет = Стр.ПравельныйОтвет;
		  //Добавляем строку в табличный документ
	      ТабДокумент.Вывести(Строка);
		  Если Строка.Параметры.ПравельныйОтвет = Истина Тогда
		      ТабДокумент.Области.Строка.ЦветТекста= WebЦвета.Красный;
		  КонецЕсли;	  

	 КонецЦикла;

КонецПроцедуры
